tap "charmbracelet/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "xo/xo"
brew "openssl@3"
brew "libyaml"
brew "ansible"
brew "node"
brew "ansible-language-server"
brew "ansible-lint"
brew "atuin", restart_service: :changed
brew "bash-language-server"
brew "bat"
brew "biome"
brew "bottom"
brew "caddy"
brew "cargo-binstall"
brew "chezmoi"
brew "curl"
brew "gmp"
brew "php"
brew "composer"
brew "csvlens"
brew "delve"
brew "docker-compose-langserver"
brew "dockerfile-language-server"
brew "dua-cli"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fish-lsp"
brew "fnox"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golangci-lint-langserver"
brew "gopls"
brew "harper"
brew "hcloud"
brew "helix"
brew "hl"
brew "imagemagick"
brew "jj"
brew "jq"
brew "jq-lsp"
brew "just"
brew "lazygit"
brew "mago"
brew "markdown-oxide"
brew "marksman"
brew "mise"
brew "mpv"
brew "nmap"
brew "oha"
brew "openssh"
brew "pandoc"
brew "poppler"
brew "postgresql@18"
brew "prettier"
brew "rainfrog"
brew "rclone"
brew "resvg"
brew "ripgrep"
brew "ruby-lsp"
brew "ruff"
brew "rumdl"
brew "rust"
brew "rv"
brew "scooter"
brew "sevenzip"
brew "slumber"
brew "solargraph"
brew "starship"
brew "taplo"
brew "terraform-ls"
brew "thefuck"
brew "tlrc"
brew "tombi"
brew "trippy"
brew "typescript-language-server"
brew "uv"
brew "vscode-langservers-extracted"
brew "wireshark"
brew "xh"
brew "xleak"
brew "yaml-language-server"
brew "yamllint"
brew "yazi"
brew "zoxide"
brew "charmbracelet/tap/crush"
brew "oven-sh/bun/bun"
brew "xo/xo/usql", args: ["with-odbc"]
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "affinity"
cask "balenaetcher"
cask "dbeaver-community"
cask "discord"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nf"
cask "ghostty"
cask "gns3"
cask "helium-browser"
cask "iina"
cask "orbstack"
cask "pgadmin4"
cask "raspberry-pi-imager"
cask "rustdesk"
cask "signal"
cask "syncthing-app"
cask "tailscale-app"
cask "winbox"
cask "wireshark-app"
cask "yubico-authenticator"
cask "zed"
cask "zen"
